
''' здесь находятся всевозможные ключевые точки '''

# если вам нужны еще больше точек, то лучше создайте свой уникальный список. Не затирайте существующие

RIGHT_EYE = [
    33, 246, 161, 160, 159, 158, 157, 173, 133,
    155, 154, 153, 145, 144, 163, 7
]

LEFT_EYE = [
    362, 398, 384, 385, 386, 387, 388, 466, 263,
    249, 390, 373, 374, 380, 381, 382
]

MOUTH = [
    78, 191, 80, 81, 82, 13, 312, 311, 310, 415,
    308, 324, 318, 402, 317, 14, 87, 178, 88, 95
]

EDGE_FACE = [
    152, 377, 400, 378, 379, 365, 397, 288, 361,
    323, 454, 356, 389, 251, 284, 332, 297, 338,
    10, 109, 67, 103, 54, 21, 162, 127, 234, 93,
    132, 58, 172, 136, 150, 149, 176, 148
]

NOSE = [1]

FACE = RIGHT_EYE + LEFT_EYE + MOUTH + EDGE_FACE + NOSE